<?php

namespace Database\Seeders;

use App\Models\PostDetail;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Carbon;

class PostDetailSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        PostDetail::truncate();
        $i = 0;
        //      About Company
        $post_id = 1;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "نبذة عن الشركة",
                    "title_en" => "About Company",
                    "slug" => "",
                    "color" => "",
                    "content_en" => "The Arabian Yemen Cement Company is a Yemeni limited liability company with a declared capital of $142,500,000 and a total project cost of $250 million.

                                    The Beginning: The idea of establishing the Arabian Yemen Cement Company Ltd. in Mukalla was born to meet the needs and demands of consumers for cement in both local and regional markets. Due to the availability of the raw materials necessary for the cement industry near Mukalla, the project was championed by Eng. Abdullah Ahmed Bugshan, a well-known businessman in Yemen and Saudi Arabia. He worked on crystallizing the project through a firm with international renown and expertise in establishing global cement projects, conducting the necessary technical studies. Consequently, work began on June 2, 2006, with pilot production starting in December 2009, marking it as one of the fundamental projects contributing to infrastructure development and economic growth in the region.

                                    Location: The production lines and administrative offices of the Arabian Yemen Cement Company are located 60 kilometers north of Mukalla, the capital of Hadramout Governorate, in the Al-Ayoun area, covering a total area of approximately 22,150 square kilometers. This site was chosen due to the presence of raw materials with a long lifespan, characterized by high purity, fineness, and superior hardness, making it economically efficient for construction.

                                    Products: The primary activity of the Arabian Yemen Cement Company is the production of Ordinary Portland Cement and Sulfate-Resistant Cement (both packed and bulk) in accordance with Yemeni standard specifications and compliant with American ASTM-C150 and European EN197 CE II standards. The products have successfully passed all required tests by the Yemen Standardization, Metrology, and Quality Control Organization.

                                    Production Capacity: The company's annual production capacity is estimated at approximately 1,500,000 tons per year.

                                    Technology: The Arabian Yemen Cement Company utilizes the latest machinery, equipment, and devices in its technical and production operations, featuring advanced German technology in cement manufacturing, power generation, and control systems. To achieve distinguished quality features, the company employs the latest computer systems and automated robotic controls for the first time in the local cement industry, ensuring the highest levels of precision and quality control throughout all stages of cement production.

                                    #####

                                    Project Cost = $250 Million

                                    Capital = $142 Million
d
                                    Production Capacity = 1,500,000 Tons Annually",
                    "content" =>" الشركة العربية اليمنية للأسمنت هي شركة يمنية محدودة برأس مال معلن وقدرة 142,500,000 دولار وبتكلفة إجمالية قدرها 250 مليون دولار أمريكي.

                                البداية : جاءت فكرة إقامة مشروع الشركة العربية اليمنية للأسمنت المحدودة في مدينة المكلا لتلبي احتياجات ورغبات المستهلكين في السوق المحلي والإقليمي من الإسمنت. ولتوفر المواد الخام اللازمة لإقامة صناعة الإسمنت بالقرب من مدينة المكلا فقد تبنى فكرة إقامة المشروع المهندس/ عبدالله أحمد بقشان وهو من رجال الأعمال المعروفين في اليمن والمملكة العربية السعودية، وقد عمل على بلورة فكرة إقامة المشروع عبر شركة ذات شهرة وخبرة عالمية في مجال إقامة مشاريع الإسمنت في العالم، وذلك بعمل الدراسات الفنية اللازمة وعلى ضوء ذلك بدء العمل في المشروع في 2/6/2006م والإنتاج التجريبي في ديسمبر 2009م، كأحد المشاريع الأساسية المساهمة في تطوير البنية التحتية والنمو الإقتصادي في المنطقة.

                                الموقع : تقع الخطوط الإنتاجية للشركة العربية اليمنية للأسمنت وكذا مكاتبها الإدارية على بعد 60 كيلومتراً شمال مدينة المكلا عاصمة محافظة حضرموت في منطقة العيون بمساحة إجمالية تقدر ب 22.150 كيلومترٍ مربع، وقد تم اختيار الموقع لوجود مواد خام عمرها الإفتراضي طويل الأمد و بالنقاوة والنعومة الفائقة والصلابة واقتصادياً في البناء.

                                المنتجات : يتمثل نشاط الشركة العربية اليمنية للأسمنت الرئيسي في إنتاج الإسمنت البورتلاندي العادي والمقاوم للكبريتات المعبأ والسائب وفقاً للمواصفات القياسية اليمنية والمطابق للمواصفات الأمريكية ASTM-C150 والأوربية EN197CEII، وقد أجتازت المنتجات بنجاح كافة الفحوصات المطلوبة من قبل الهيئة اليمنية للمواصفات والمقاييس وضبط الجودة.

                                الطاقة الإنتاجية:تقدر طاقة الشركة الإنتاجية من الإسمنت حوالي 1,500,000طن / لسنة.

                                التكنولوجيا : تمتلك الشركة العربية اليمنية للأسمنت أحدث الآلات والمعدات والأجهزة في عملياتها الإنتاجية والفنية ذات تقنية ألمانية متقدمة في صناعة الإسمنت وتوليد الطاقة وعمليات التحكم، لتحقيق الميزات النوعية للجودة المتميزة للإسمنت بإستخدام أحدث الأنظمة الحاسوبية وأجهزة التحكم الآلي (الروبوت) لأول مرة في صناعة الإسمنت، لضمان أعلى درجات الدقة والتحكم لجودة كافة عمليات إنتاج الإسمنت.

                                #####

                                تكلفة المشروع = 250 مليون دولار

                                راس المال = 142 مليون دولار

                                الطاقة الإنتاجية = 1500000 طن سنويا",

                     "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "النزاهة / الأمانة",
                    "title_en" => "النزاهة / الأمانة",
                    "slug" => "",
                    "color" => "heroicon-o-shield-check",
                    "content" => "نتعامل مع شركائنا بمصداقية وشفافية وملتزمون بأعلى معايير النزاهة",
                    "content_en" => "نتعامل مع شركائنا بمصداقية وشفافية وملتزمون بأعلى معايير النزاهة",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "السلامة المهنية",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "heroicon-o-user-group",
                    "content" => "نهتم بسلامة عاملينا وموظفينا",
                    "content_en" => "",
                    "order" => 3,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "الجودة",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "heroicon-o-cog-6-tooth",
                    "content" => "نتبع أعلى معايير الجودة",
                    "content_en" => "",
                    "order" => 4,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "الزمالة / الشراكة",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "heroicon-o-user-plus",
                    "content" => "نثق بشركائنا في النجاح ونعمل معهم كفريق واحد",
                    "content_en" => "",
                    "order" => 5,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "رضا العملاء",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "heroicon-o-face-smile",
                    "content" => "نسعى دائماً لإرضاء عملائنا",
                    "content_en" => "",
                    "order" => 6,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "المجتمع",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "heroicon-o-globe-alt",
                    "content" => "نهتم بالمحافظة على بيئتنا ونساهم بفاعلية في خدمة وتطوير مجتمعنا",
                    "content_en" => "",
                    "order" => 7,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "التكنولوجيا",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "heroicon-o-light-bulb",
                    "content" => "نسعى بعزم للتطوير والإبتكار",
                    "content_en" => "",
                    "order" => 8,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );
        //      Management Board
        $post_id = 9;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "المهندس / عبدالله أحمد سعيد بقشان",
                    "title_en" => "",
                    "slug" => "رئيس مجلس الإدارة",
                    // "slug_en" => "رئيس مجلس الإدارة",
                    "color" => "",
                    "content_en" => "",
                    "content" => "إن رغبتنا في الإستثمار في إنشاء المصنع أتت من رغبتنا الصادقة في خدمة مجتمعنا وبيئتنا والسعي دائماً لتحويل مجتمعنا إلى مجتمع أكثر تطوراً وإزدهاراً، وتنشيط وتنمية القطاع الصناعي تحسيناً لإقتصادنا الوطني.

                    تعهدت شركتنا منذ تأسيسها من خلال إلتزامها بالقيم الإنسانية إجمالاً وبقيمها الخاصة والتي نسعى دائماً لترسيخها بين العاملين في الشركة بما يضمن تطبيقها في معاملتنا في ما بيننا وفي معاملتنا مع شركائنا في النجاح.

                    ألتزمت شركتنا وتسعى دائماً في أن تنال رضاء عملائها وتلبي إحتياجاتهم وتوقعاتهم من خلال تشكيلة متنوعة من الإسمنت ذات الجودة العالية وفقاً للمواصفات العالمية، وتزويد كل الأسواق في الوطن، ساعين بذلك الى توفير منتج أساسي ورئيسي يساعد ويشارك في تطوير البنيه التحيته للوطن، ساعين أيضاً إلى المساهمة في التنمية الإقتصادية والإجتماعية والبيئية على كافة المستويات، واضعين نصب أعيننا التطوير المستمر لعملنا التجاري والصناعي، والقائم أساساً على العنصر البشري الخلاّق الذي يمثل أهم أصول الشركة، ساعين دائماً إلى تطوير وتدريب كوادرنا المستمر، ونؤكد ثقتنا في قدرة فريق العمل بما لديه من خبرة وكفاءة بأنه سيكون جدير بنيل ثقة وإحترام عملائنا.

                    ونحن في الشركة العربية اليمنية للأسمنت المحدودة واثقون بالله أولاً ثم بما لدينا من عاملين في الشركة ثانياً، بأننا سنتمكن من تخطي كل التحديات والعقبات والتي بها سنحقق رؤيتنا.",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "المهندس / عبدالله أحمد سعيد بقشان",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "رئيس مجلس الإدارة",
                    "content_en" => "",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "الدكتور / زامل بن عبدالرحمن المقرن",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "نائب رئيس مجلس الإدارة",
                    "content_en" => "",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "المهندس / محمد ناصر حبتور",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "عضو مجلس الإدارة",
                    "content_en" => "",
                    "order" => 3,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "الدكتور / وليد عمر باحمدان",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "عضو مجلس الإدارة",
                    "content_en" => "",
                    "order" => 4,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "المهندس / فهد بن راشد العتيبي",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "عضو مجلس الإدارة",
                    "content_en" => "",
                    "order" => 5, //13
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "المهندس / عبدالله محمد العمودي",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "عضو مجلس الإدارة",
                    "content_en" => "",
                    "order" => 6,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "السيد / حسن عبدالله باروم",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "عضو مجلس الإدارة",
                    "content_en" => "",
                    "order" => 7,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "الأستاذ / إبراهيم بن سالم الرويس",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "عضو مجلس الإدارة والإبتكار",
                    "content_en" => "",
                    "order" => 8,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );

        //      vision and message
        $post_id = 18;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "رؤيتنا",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "أن نكون رواد صناعة وتوزيع الإسمنت في المنطقة",
                    "content_en" => "",
                    "order" => 0,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "رسالتنا",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "<b><span style='font-size: 18px;'>تتعهد الشركة بأن تعمل بجد في إنتاج وبيع تشكيلة متنوعة من منتجات الإسمنت، تلبيةً لإحتياجات ورغبات عملائنا في السوق المحلي والإقليمي، متجاوزين توقعات عملائنا وبجودة عالية وبأسعار منافسة، بما يحقق المصلحة المشتركة، مع الإلتزام والمحافظة على البيئة والسلامة من خلال توفير كوادر وخبرات بشرية ماهرة واستخدامنا للتكنولوجيا الحديثة.</span></b>",
                    "content_en" => "",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id,
                    "category_id" => 1,
                    "title" => "أهدافنا",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" =>
                    "<p><b><span style='font-size: 18px;'>⦁ الوفاء بإلتزاماتنا لجعل صناعة الإسمنت شريكاً أساسياً في بناء المجتمع و المساهمة في تطوير البنية التحتية والنمو الإقتصادي في البلد.</span></b></p><p><b><span style='font-size: 18px;'>⦁ إنتاج إسمنت وفق المعايير العالمية وذو جودة عالية و توفير تشكيلة متنوعة من منتجات الإسمنت إلى جميع عملائنا، وذلك باستخدام تكنولوجيا صديقة للبيئة وضمان تطبيق معايير السلامة و الصحة. </span></b></p><p><b><span style='font-size: 18px;'>⦁ نسعى جاهدين للإبتكار و إيجاد الحلول من خلال توفير أفضل الخبرات و ضمان سلاسة الإجراءات والعمليات و الأنظمة.</span></b></p><p><b><span style='font-size: 18px;'>⦁ العمل على تطوير صناعة الإسمنت والوصول إلى مستويات جديدة من التطور وزيادة القيمة المضافة للمنتج، وذلك بالإعتماد على خبراتنا التحليلية المتخصصة بقضايا التقنية والإبتكار، لضمان تقديم أفضل نوعية من الإسمنت.</span></b></p><p><b><span style='font-size: 18px;'>⦁ الإستثمار في تطوير العلاقات مع جميع الشركاء على حد سواء، لتقديم أفضل الحلول والوصول إلى أقصى حدود الإنتاج، مع التفكير بحرص لتطوير الأعمال تحقيقاً للمنفعة المشتركة.</span></b></p>",
                    "content_en" => "",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );

        //      Social Responsibility
        $post_id = 21;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "البيئة",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "عززت الشركة العربية اليمنية للأسمنت المحدودة سبل الأمن والسلامة والمحافظة على البيئة من خلال توفير أحدث التكنولوجيا المتطورة في السيطرة على الغبار، فهناك نظام إخماد متطور يقوم برش الماء المنظم مع فلترات خاصة لمنع إنتشار الغبار، كما تمرر الغازات المنطلقة من الفرن ومن قسم طحن المواد الأولية عبر بيت مكيس للتحكم بالغبار مع استمرار الغازات المبردة من خلال المرسب الإكتروني المثبت لإخماد الغبار، فيما تحتوي المطاحن على فلترات للغبار عند الإستخلاص الفعلي للإسمنت الأرضي، إضافة إلى فلاتر خاصة في كل آلة تعبئة ومنظف تفريغ متنقل لإمتصاص الغبار المتطاير أينما وجد، كل ذلك تفادياً للثأثيرات السلبية على المجتمع وعلى العاملين بالشركة.",
                    "content_en" => "",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "التدريب",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "إنطلاقاً من ثقافة الإهتمام بالكادر البشري، وإعتباره أهم أصول المنشأة، أنتهجت الشركة العربية اليمنية للأسمنت المحدودة إعطاء أولوية مطلقة في سبيل تنمية كوادرها البشرية بتوفير مايلزم من التدريب والتأهيل والرقي بهم وبمهاراتهم في شتى المجالات.

                            وإيماناً من الشركة العربية اليمنية للأسمنت المحدودة بمفهوم المساهمة المجتمعية سعت إلى توسيع مستوى التدريب للكوادر المحلية تتجاوز حدود مصالحها مشركة المجتمع في ماتقدمه من برامج تدريبية متنوعة للرقي بكوادره والإسهام في دفع عجلة التقدم و الإزدهار. وتحقيقاً لما تبنته الشركة العربية اليمنية للأسمنت المحدودة فقد وضعت نصب عينيها تطوير وتحديث برامجها التدريبية لتكون مواكبة لمجريات التطورات العالمية المستمرة.
                            وإستمراراً منها في نهج التطوير والتدريب للمجتمع وكوادره فقد عملت على صناعة برامج تدريبيَّة متخصِّصة في تنمية المجتمع أسهاماً منها في الرقي بمستوى الكوادر المحليَّة علميَّاً وعمليَّاً, حيث أسَّست برامج التدريب لحديثي التخرُّج كذلك برامج التدريب للأفراد تحت التخرُّج وغيرها من البرامج التي ترنو إلى الدفع بعجلة تقدُّم المجتمع وكوادره..",
                    "content_en" => "",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "الخدمات الطبية",
                    "title_en" => "",
                    "slug" => "",
                    "color" => "",
                    "content" => "إنطلاقاً من مبدأ المساهمة المجتمعيَّة الذي أنتهجته الشركة العربيَّة اليمنيَّة للأسمنت المحدودة في تنفيذ نشاطاتها فقد طوَّعت عيادتها الطبيَّة المجهَّزة في خدمة المجتمع المحيط بها موفِّرة له خدمات الإسعافات الأوَّلية الضروريَّة متى ما لزم ذلك, متكفِّلةً بنقله إلى المستشفى بواسطة سيَّارة الإسعاف الخاصة بالشركة والمجهزة بإحدث المعدات اللازمة.
وتعزيزاً لمساهمتها في خدمة المجتمع تقوم الشركة العربيَّة اليمنيَّة للأسمنت المحدودة بالمشاركة في أنشطة المؤسسات والمراكز الطبية المتخصصة من خلال التمويل والدعم لتلك المؤسسات، كما تسعى الشركة العربية اليمنية للأسمنت المحدودة إلى إقامة بعض العيادات التخصُّصيَّة لأبناء المناطق المجاورة للشركة.",
                    "content_en" => "",
                    "order" => 3,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );

        //      products
        $post_id = $i + 24;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "أسمنت حضرموت",
                    "slug" => "",
                    "color" => "",
                    "content" =>
                    "يعتبر إسمنت حضرموت من أكثر أنواع الإسمنت البورتلاندي شيوعاً واستخداماً ويصنع هذا الإسمنت طبقاً للمواصفات الأوروبية:
BS EN 197-1:2000 CEM II 42.5N
<p>ويدخل في جميع الأعمال الخرسانية والخرسانة المسبقة الإجهاد أو الصب والأنابيب الخرسانية، وصالح لجميع أعمال البلوك والبلاط الإسمنتي.
                            يتم توفير المنتج بشكل أكياس عبوة 50 كيلو جرام أو على شكل سائب في جميع أنحاء الجمهورية اليمنية.
                            </p><li class='text-green-900'>
                                                        أمثلة الإستخدام:
                            </li><li>
                                                        - الخرسانة الجاهزة.
                            </li><li>
                                                        - القواعد والأساسات.
                            </li><li>

                                                        - الصبات الخرسانية .
                            </li><li>

                                                        - الكباري وبناء الأبراج.
                            </li><li>

                                                        - الطرق الخرسانية.
                            </i>",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "أسمنت العربية",
                    "slug" => "",
                    "color" => "",
                    "content" =>
                    "يعتبر من أنواع الإسمنت البورتلاندي حيث يتم إنتاجه وفق المواصفات الأوروبية BS EN 197-1:2000 CEM II 32.5N
                    <p>ويستخدم في جميع الأعمال الخرسانية والتشطيبات للمنشئات السكنية والقواعد الخرسانية وصناعة الطوب والبلوك، ويمتاز أسمنت العربية البورتلاندي بتحسين عملية التشغيل والحد من التشققات الناتجة من تمدد الركام( الكري )، وهو ذو مقاومة متوسطة لأملاح الكبريتات MSRC وزيادة مقاومة الخرسانة للتفاعلات القلوية وإنخفاض الوزن النوعي للخرسانة مما يساهم في تخفيف وزن الخرسانة، المصنعة منه والتقليل من آثار التشققات في الخلطة الخرسانية، ويمتاز كذلك بأن معدل تطور القوة النهائية في الإسمنت البوزلاني أعلى منها في الإسمنت العادي ويعمر لفترات أطول.
                            </p><p>
                            يتم توفير المنتج بشكل أكياس عبوة 50 كيلو جرام أو على شكل سائب في جميع أنحاء الجمهورية اليمنية.
                            </p><li class='text-green-900'>
                                                        أمثلة الإستخدام:
                            </li><li>
                            -  مصانع البلوك بكافة أنواعه.

                            </li><li>
                            -  الأنابيب الخرسانية المعرضة للمياه ذات النسبة العالية من الكبريتات (مياه السبخات والصرف الصحي والتي لاتتطلب قوة تحمل عالية جداً.
                            </li><li>
                            -  محطات الصرف الصحي الصغيرة.
                            </li><li>

                            -  الكباري الصغيرة والمخصصة لصرف مياه السيول.

                            </li>",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "أسمنت حضرموت المقاوم للأملاح",
                    "slug" => "",
                    "color" => "",
                    "content" =>
                    "يتميز الإسمنت المقاوم بمحتواه المنخفض من الومنيات ثلاثي الكاليسوم، حيث يقاوم البيئة المشبعة بأملاح الكبريتات، وإسمنت حضرموت المقاوم للأملاح يصنع طبقاً للمواصفات الأوروبية :
ASTM C 150-TAPE V
BS 4027 :1996 42.5N
<p>ويستخدم في جميع الأعمال الخرسانية والتشطيبات للمنشئات السكنية والقواعد الخرسانية وصناعة الطوب والبلوك، ويمتاز ويستخدم في كافة أنواع المنشئات الخرسانية المعرضة مباشرة لأملاح الكبريتات أو في البيئة المشبعة بها، ومنها الخرسانة المسلحة للقواعد وأعمال الصرف الصحي والمجاري وخزانات المياه والخوازيق بأنواعها، وصناعة المواسير الخرسانية والسدود والحواجز المائية وجميع أنواع البناء في المناطق الساحلية والمعرضة للمياه الجوفية.
                            </p><p>
                            يتم توفير المنتج بشكل أكياس عبوة 50 كيلو جرام أو على شكل سائب في جميع أنحاء الجمهورية اليمنية.
                            </p><li class='text-green-900'>
                                                        أمثلة الإستخدام:
                            </li><li>
                            - الأنابيب الخرسانية المعرضة للمياه ذات النسبة العالية من الكبريتات (مياه السبخات والصرف الصحي)
                            </li><li>
                            - الأعمال البحرية كالموانئ والأرصفة (التي تحتاج إلى قوة تحمل عالية)
                            </li><li>
                            - القواعد والأساسات ( التي تحتاج إلى قوة تحمل عالية )
                            </li><li>
                            - محطات الصرف الصحي ( القواعد والأساسات الإنشائية)
                            </li>",
                    "order" => 3,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );
        //      Customer Service
        $post_id = $i + 27;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "شركاء النجاح",
                    "slug" => "",
                    "color" => "",
                    "content" =>
                    "
نحن في الشركة العربية اليمنية للاسمنت المحدودة، نضع رضاكم في مقدمة أولوياتنا. بصفتكم شركاء النجاح في مسيرتنا، فإننا نلتزم بتقديم أفضل تجربة دعم فني وخدمة عملاء ممكنة.

سواء كنتم تبحثون عن معلومات حول منتجاتنا، أو تحتاجون إلى استشارات فنية لمشاريعكم، أو لديكم أي استفسار أو ملاحظة، فإن فريقنا المتخصص على أتم الاستعداد لتقديم المساعدة.

نؤكد لكم أن منتجاتنا تخضع لأعلى معايير الجودة العالمية، ونسعد بتقديم كل ما يلزم من شهادات ومواصفات لضمان ثقتكم ونجاح أعمالكم. شركاؤنا ومساهمتكم هي التي تدفعنا دوماً نحو التميز.

وسائل التواصل مع خدمة العملاء وفريق البيع :
قسم الترحيل : 00967712004366
فاكس المبيعات المصنع : 0096705355801
تلفون : 355800 تحويلة 611
تلفون فرع عدن : 02512800
فاكس  : 02512802
جوال : 00967711003019

",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );

        //      Employees Advantages
        $i = 1;
        $post_id = $i + 27;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "الرعاية الصحية",
                    "slug" => "",
                    "color" => "",
                    "content" => "حرصت الشركة العربيَّة اليمنيَّة للأسمنت المحدودة على توفير الرعاية الصحية لموظفيها وأفراد أسرهم في أفضل المستشفيات، إيقاناً منها بأنَّ الشخص السليم يقدِّم الإنجاز السليم، وانطلاقاً من هذا المعتقد أسَّست عيادة طبيَّة متكاملة في موقع الشركة تعمل على مدار الساعة لتقديم الدعم الطبِّي اللَّازم لأيِّ طارئ يحدث في موقع العمل، ووفرت الشركة سيارة إسعاف بكامل تجهيزاتها، تستخدم لنقل الحالات الحرجة إلى المستشفى لتوفير الرعاية الصحية اللازمة. ",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "التغذية",
                    "slug" => "",
                    "color" => "",
                    "content" => "انطلاقاً من مبدء الرعاية الكاملة للموظف قامت الشركة بتجهيز مطعم متكامل وصالات تغذية بموقع الشركة، لتقديم وجبات الطعام المناسبة لجميع الموظفين أثناء تواجدهم في الشركة.",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "المواصلات",
                    "slug" => "",
                    "color" => "",
                    "content" => "وفرت الشركة العربيَّة اليمنيَّة للأسمنت المحدودة وسائل المواصلات الحديثة والمريحة لنقل الموظفين من أماكن إقامتهم إلى موقع الشركة، سعياً منها لتوفير الراحة الذهنية والجسدية لموظفيها.",
                    "order" => 3,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "السكن",
                    "slug" => "",
                    "color" => "",
                    "content" => "قامت الشركة العربية اليمنية للأسمنت المحدودة ببناء وتأثيث سكن في حرم الشركة خاص بموظفيها المقيمين في مناطق بعيدة عن الشركة أو الوافدين من خارج الوطن، مجهزاً بوسائل الراحة والترفيه الضرورية لتخفيف العبء الناجم عن مفارقة أهلهم.",
                    "order" => 4,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "التدريب والتأهيل",
                    "slug" => "",
                    "color" => "",
                    "content" => "إيماناً من إدارة الشركة العربيَّة اليمنيَّة للأسمنت المحدودة بدور التدريب والتأهيل في الرقي بفريق العمل والزيادة من إنتاجه، وتحقيقاً للهدف الذي وضعت نصب عينيها تحقيقه –يمننة الوظائف-, فقد سعت إلى تعديد وسائل وأساليب التدريب والتأهيل للكادر المحلِّي، منتقية أفضل تلك الأساليب والوسائل، مولية إهتماماً أكثر بنتائج المنفَّذ من تلك البرامج، كي تصل إلى أقصى مستويات الرضاء بالموجود، مصحِّحةً أيَّ إنحراف قد يطرأ على سير عمليَّة تأهيل الكادر المحلِّي والإرتقاء به.",
                    "order" => 5,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );

        //      News and Activities
        $post_id = $i + 32;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "تدشين مشروع شراء الأدوية والمعدات الطبية لمؤسسة سدن من الشركة العربية اليمنية للأسمنت المحدودة",
                    "slug" => "تدشين-مشروع-شراء-الأدوية-والمعدات-الطبية-لمؤسسة-سدن",
                    "color" => "",
                    "content" =>
                    "تدشين مشروع شراء الأدوية والأجهزة والمعدات الطبية لمرضى الثلاسيميا وأمراض الدم الوراثية بدعم من الشركة العربية اليمنية للأسمنت المحدودة
                        دشن المهندس / عبدالله اللبني مساعد المدير العام للشركة العربية اليمنية للأسمنت المحدودة بمعية  الدكتور محمد صالح الجمحي المدير العام لمكتب وزارة الصحة العامة والسكان بساحل حضرموت والأستاذ / سالم باجحاو المدير التنفيذي لمؤسسة سدن للثلاسيميا وأمراض الدم الوراثية مشروع شراء الأدوية والأجهزة والمعدات الطبية لمرضى الثلاسيميا وأمراض الدم الوراثية بدعم من الشركة العربية للأسمنت المحدودة .
                        وفي حفل التدشين اكداً المهندس عبدالله اللبني على استمرار توجه قيادة الشركة بدعم المشاريع الإنسانية والتنموية المرتبطة بحياة المواطن.
                        كما  أشاد المدير العام لمكتب الصحة والسكان الدكتور / محمد الجمحي بمساهمة الشركة العربية للأسمنت المحدودة ودعمها للقطاع الصحي في حضرموت من خلال رفد المرافق الصحية والمؤسسات بالاجهزة والمعدات الطبية التي تسهم في تخفيف معاناه المرضى وكذلك تطوير وتحسين الخدمات الطبية والعلاجية التي تقدم للمرضى في جميع المرافق الصحية مشيرا إلى أن مكتب الصحة حريص لربط علاقات شراكة تكاملية مع هذه الجهات الداعمة منها الشركة العربية للأسمنت المحدودة .
                        من جانبه أشار المدير التنفيذي لمؤسسة سدن للثلاسيميا وأمراض الدم الوراثية الأستاذ / سالم باجحاو  إلى أن هذه الأدوية والأجهزة ستعمل على تخفيف معاناة المرضى واسعادهم كونها تعد باهضة الثمن ولا يستطيع المرضى شرائها مثمنا جهود مكتب الصحة والسكان وكذلك الشركة العربية اليمنية للأسمنت المحدودة لدعمهم لهذا المشروع داعيا بأن يستمر هذا الدعم والعطاء لسنوات قادمة لمساعدة المرضى المحتاجين وتخفيف معاناتهم المرضية مقدما لهم الشكر والتقدير والشكر موصول للمهندس وهيب العزب الرئيس التنفيذي  للشركة العربية للأسمنت المحدودة والشيخ المهندس عبدالله أحمد بقشان رئيس مجلس إدارة الشركة لجهودهم في دعم مشروع الأدوية والأجهزة الطبية بالمؤسسة.
                        بعد ذلك قام المدير العام لمكتب الصحة والسكان ومساعد المدير العام للشركة العربية اليمنية للأسمنت المحدودة والمدير التنفيذي لمؤسسة سدن للثلاسيميا وأمراض الدم الوراثية ومرافقيهم بزيارة تفقدية لاقسام المؤسسة تعرفوا خلالها على سير الخدمات الطبية والعلاجية التي تقدمها المؤسسة للمرضى مشيدين بمستوى التنظيم والترتيب لاستقبال الحالات اليومية ومعالجتها بشكل مستمر.",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "الشركة العربية اليمنية للأسمنت تمّول صندوق رعاية وتأهيل المعاقين محور حضرموت بقيمة 30 مليون",
                    "slug" => "الشركة-العربية-اليمنية-للأسمنت-تمّول-صندوق-رعاية-وتأهيل-المعاقين-محور-حضرموت-بقيمة-30-مليون",
                    "color" => "",
                    "content" => "جرى يوم الثلاثاء الموافق 04/02/2020 بمقر الشركة العربية اليمنية للأسمنت المحدودة التوقيع على إتفاقية دعم وتمويل علاجات الأمراض المزمنة بمبلغ إجمالي 30 مليون ريال بدعم من الشركة العربية للأسمنت المحدودة.
وقع الاتفاقية عن الشركة م. وهيب العزب المدير التنفيذي للشركه وعن صندوق رعاية وتأهيل المعاقين أ. أحمد حسين اليهري مدير عام الصندوق، ومن جانبه قال العزب ان هذه الاتفاقية تأتي ضمن توجه وإستراتيجية الشركه للدعم والمساهمه في قطاعات عديده منها الصحه والتعليم والبنية التحتية في الوطن، وذلك من خلال عقد شراكات مع مؤسسات ومنظمات مجتمع مدني عامله في هذه القطاعات، وتخفيف معاناة المرضى من ذوي الأمراض المزمنة وتجسيد مبدأ التكافل الاجتماعي بين أفراد المجتمع ، وذلك إستشعاراً منها بالمسئولية المجتمعيه وتحقيقاً لشعارها (معاً لخدمة مجتمعنا)
 من جانبه أعرب اليهري عن سعادته لهذه الرعاية والمبادرة من الشركة ممثلة بجميع أعضاء مجلس إدارة الشركه وعلى رأسهم الشيخ المهندس عبدالله بقشان رئيس مجلس إدارة الشركه وذلك اهتمامهم الكبير بشريحة المعاقين.
وأشار اليهري الى ان الصندوق  يختص في شئون المعاقين ومساعدتهم ودعمهم في مواجهة احتياجاتهم من علاجات الأمراض المزمنة، وأضاف اليهري ان هذا ليس بغريب على الشركة هذا الاهتمام بشريحة المعاقين والتي لها إسهامات في مجالات كثيرة.
حضر  مراسيم توقيع الاتفاقية عدد من مدراء الإدارات في الشركة.",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "الشركة العربية اليمنية للإسمنت تهدي مركز جامعة حضرموت لطب الأسرة سيارة إسعاف متكاملة التجهيزات",
                    "slug" => "الشركة-العربية-اليمنية-للإسمنت-تهدي-مركز-جامعة-حضرموت-لطب-الأسرة-سيارة-إسعاف-متكاملة-التجهيزات",
                    "color" => "",
                    "content" => "أهدت الشركة العربية اليمنية للإسمنت المحدودة بالمكلا مركز جامعة حضرموت لطب الأسرة سيارة اسعاف متكاملة التجهيزات،

وجرت عملية التسليم في مقر الشركة العربية، بين المدير العام للشركة المهندس وهيب عبدالواحد العزب

ونائب رئيس جامعة حضرموت للشؤون الأكاديمية الدكتور عبدالله صالح بابعير، بحضور نائب رئيس الجامعة للدراسات العليا الدكتور هادي الصبان، ومديرة المركز الدكتورة عفاف عبدالله الشاذلي، والمدير الإداري للمركز الأخ عبدالرحمن سالم باشعيب؛ ومن الشركة العربية ، مساعد المدير العام المهندس عبدالله اللبني.

وأثناء عملية التسليم، أشاد المدير العام للشركة بالجهود المبذولة من قبل قيادة الجامعة في تأدية رسالتها التعليمية، مبيناً بأن هذا الدعم يأتي في إطار مساهمة الشركة في خدمة المجتمع المحلي في شتى المجالات، مستعرضاً الدور الذي قامت به الشركة بالتعاون مع السلطة المحلية في توسعة عقبة(عبدالله غريب) التي تربط الساحل بالوادي، موضحاً بأن الشركة تساهم في القطاعين التعليمي والصحي، من خلال توفير الأجهزة والمعدات، وبعض المساهمات الأخرى. مبيناً بأن الشركة لديها توجه لإقامة مركز تدريب، يعمل على تدريب وتأهيل كوادر الشركة في شتى التخصصات، متمنياً بأن يكون هناك تعاونا في هذا المجال مع الجامعة.

من جانبه شكر الدكتور بابعير الشركة العربية اليمنية للإسمنت، على الدعم والمساندة لجامعة حضرموت، ناقلاً تحيات رئيس الجامعة الدكتور محمد سعيد خنبش لقيادة الشركة، ولمجلس إدارتها.",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "افتتاح وتدشين المسار الجديد لطريق عقبة عبدالله غريب",
                    "slug" => "افتتاح-وتدشين-المسار-الجديد-لطريق-عقبة-عبدالله-غريب",
                    "color" => "",
                    "content" => "برعاية كريمة من رئيس الجمهورية المشير الركن عبدربه منصور هادي افتتح محافظ محافظة حضرموت قائد المنطقة العسكرية الثانية اللواء الركن فرج سالمين البحسني اليوم ودشن العمل في مشروع المسار الجديد لطريق عقبة عبدالله غريب بمديرية غيل باوزير الخط الاستراتيجي المهم الرابط بين ساحل ووادي حضرموت والممول بنسبة 75% من السلطة المحلية بالمحافظة و25% منالشركة العربية اليمنية للإسمنت المحدودة وتنفيذ شركة إس إس يمن للمقاولات بتكلفة إجمالية بلغت 680 مليون ريال يمني.
واعرب محافظ حضرموت عقب الافتتاح عن ارتياحه لافتتاح المسار الجديد للعقبة الذي يعد مشروعا حيويا في مجال الطرقات لكون الطريق السابق كان مصدرا رئيسيا للحوادث التي ذهب ضحيتها الكثير من المواطنين خلال السنوات الماضية، ناقلاً في كلمته تحيات فخامة رئيس الجمهورية وتهانيه لأبناء حضرموت بإنجاز هذا المشروع المهم.
وأشاد محافظ حضرموت بجهود العمال واصفا اياهم بأنهم أبطال هذا المشروع، متقدما بالشكر لإدارةالشركة العربية اليمنية للاسمنت المحدودة والمقاول وكل من ساهم في انجاحه، لافتا إلى أن هذا المشروع كان أول مشروع اقدم عليه عند تقلده لمنصب المحافظ، مؤكدا على أن حضرموت قادمة على استثمارات كبيرة.
من جانبه قال المدير العام للشركة المهندس وهيب العزب بأن الشركة كانت ولازالت تساهم بفاعلية في خدمة المجتمع وتنميته، لافتا إلى أن الشركة قدمت خلال الثلاث الأعوام الماضية مليار و 200 مليون ريال يمني كإسهامات في العديد من المجالات المختلفة ودعم الجوانب الأنسانية في حضرموت وخارجها تحقيقا لاهداف الشركة نعم لخدمة مجتمعنا.
وأكد المهندس العزب بأن الشركة مستعدة لتوقيع إتفاقيات جديدة مع السلطة المحلية لتنفيذ مشاريع أخرى بعد نجاح مشروع المسار الجديد ، شاكرا محافظ حضرموت ورئيس مجلس إدارة الشركةوأعضاء مجلس أمنائها والمقاول المنفذ للمشروع وطاقم الشركة والمسؤولين والمواطنين وكافة من ساهم في انجاز هذا المشروع الحيوي.
كما اقيم عقب تدشين المسار الجديد حفلاً بهيجا بالمناسبة القيت خلاله كلمة مسجلة لرئيس مجلس إدارةالشركة الشيخ المهندس عبدالله احمد بقشان أعرب فيها عن السعادة بافتتاح المشروع الذي يعد اهم مشاريع الشركة وأولها في اطار الشراكة مع السلطة المحلية بالمحافظة
وكلمة أخرى لمدير عام شركة إس إس يمن للمقاولات سالم سلطان الحر استعرض خلالها مراحل العمل بالمسار الجديد
وتخللت الحفل أغنية ترحيبية بصوت الفنان مازن السيباني ويعتبر من عمال الشركة، وعرض إعلانات لمنتجات الشركة وربورتاج عن تنفيذ مشروع المسار الجديد للعقبة.
وطاف المحافظ البحسني عقب ذلك بأقسام المصنع متعرفاً على آلية العمل فيه ومطلعاً على جهود العاملين في تطويره وزيادة انتاجه.
وتم في ختام الحفل تكريم محافظ حضرموت بدرع الشركة تقديراً لدوره في خدمة الاستثمار وانجاز هذا المشروع الحيوي وتكريم عدد من المسؤولين الذين اسهموا في انجاح انشطتها المختلفة.
حضر التدشين والفعالية وكيل حضرموت للشؤون الفنية المهندس محمد العمودي ووكيل حضرموت الساحل والهضبة الدكتور سعيد عثمان العمودي والوكيل المساعد لشؤون الشباب فهمي باضاوي ومدير عام الأمن والشرطة بساحل حضرموت العميد سالم الخنبشي ومدير عام الأشغال العامة والطرق بساحل حضرموت المهندس فارس بن شملان ومدير عام مديرية غيل باوزير الدكتور عدنان حمران وعدد من المسؤولين المدنيين والعسكريين والشخصيات الاجتماعية وابناء المناطق المجاورة لمقر الشركة.",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "الشركة العربية اليمنية للاسمنت المحدودة توزع اثاث مكتبي لعدة مدارس",
                    "slug" => "الشركة-العربية-اليمنية-للاسمنت-المحدودة-توزع-اثاث-مكتبي-لعدة-مدارس",
                    "color" => "",
                    "content" => "تم صباح اليوم الثلاثاء الموافق 28/03/2018م توزيع اثاث مكتبي ومدرسي للمدارس المحيطة بموقع المصنع حيث تم توزيعها على مجمع بارشيد التعليمي (للبنين-البنات ) ، مدرسة غيل الحالكة ، مدرسة رأس محل ، مدرسة كتيبة ، مدرسة عبدالله غريب ، مدرسة رأس حويرة وذلك ضمن جهود الشركة العربية اليمنية للاسمنت المحدودة واسهاماتها المستمرة في دعم عجلة العلم و التعليم تحت شعار معاً لخدمة مجتمعنا ، حيث اكد مدير عام الشركة المهندس وهيب عبدالواحد العزب ان المساهمة المجتمعية احد اهم قيم الشركة حيث تقوم الشركة بتقديم مساهمات في عدة مجلات وخصوصاً التعليم.
 وفي اثناء التوزيع شكر مدراء المدارس ادارة الشركة العربية اليمنية للاسمنت المحدودة وقامو باهداء درع عرفانا منهم بما تقدهم الشركة من اسهامات في ظل الظروف الصعبة التي تمر بها البلاد.",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );

        //      Social Media
        $post_id =  38;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "فيسبوك",
                    "title_en" => "FaceBook",
                    "slug" => "",
                    "color" => "",
                    "content" => "https://www.facebook.com/AYCCLYemen/",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "اكس (تويتر)",
                    "title_en" => "X (twitter)",
                    "slug" => "",
                    "color" => "",
                    "content" => "https://x.com/aycclyemen",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "انستجرام",
                    "title_en" => "Instagram",
                    "slug" => "",
                    "color" => "",
                    "content" => "https://www.instagram.com/aycclyemen/",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "يوتيوب",
                    "title_en" => "YouTube",
                    "slug" => "",
                    "color" => "",
                    "content" => "https://www.youtube.com/@AYCCLYemen",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "لينكدإن",
                    "title_en" => "LinkedIn",
                    "slug" => "",
                    "color" => "",
                    "content" => "https://www.linkedin.com/company/aycclyemen/",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );
        $i += 3;
        //      Documents
        $post_id = $i + 39;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "اسمنت حضرموت",
                    "title_en" => "Hadramout Cement",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "أسمنت العربية",
                    "title_en" => "Arabian Cement",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "أسمنت حضرموت المقاوم للأملاح",
                    "title_en" => "Hadramout salt-resistant cement",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );

        //      Contact Us
        $post_id = $i + 42;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "العنوان :",
                    "slug" => "",
                    "color" => "heroicon-c-map-pin",
                    "content" => "الجمهورية اليمنية - محافظة حضرموت - المكلا",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "الايميل :",
                    "slug" => "",
                    "color" => "heroicon-m-envelope",
                    "content" => "hcp@ayccl.com",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "الهاتف :",
                    "slug" => "",
                    "color" => "heroicon-s-phone",
                    "content" => "+967 5355 800",
                    "order" => 3,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "الفاكس :",
                    "slug" => "",
                    "color" => "heroicon-s-printer",
                    "content" => "+975 755 5801",
                    "order" => 4,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );
        $i +=2;
        //      Photos Galary
        $post_id = $i + 44;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 11,
                    "title" => "عن الشركة",
                    "slug" => "",
                    "color" => "",
                    "content" => "الوصف: معرض يتعلق بعرض مرفقات الشركة.",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 7,
                    "title" => "حفل مرضى السرطان",
                    "slug" => "",
                    "color" => "",
                    "content" => "الوصف: قامت الشركة بعمل حفل لمرضى السرطان.",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );
        //      Videos
        $post_id = $i + 46;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 9,
                    "title" => "أعلان اسمنت العربية",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 9,
                    "title" => "أسمنت حضرموت ثقة بحجم الاسم",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 9,
                    "title" => "إعلان الشركة العربية اليمنية للأسمنت المحدودة",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 9,
                    "title" => "المسار الجديد لعقبة عبدالله غريب",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 9,
                    "title" => "كوفر جديد للأغنية المصرية الخالدة #رمضان_جانا_وفرحنابه بالاسلوب اليمني الصنعاني والحضرمي",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );

        //      Welcome (Slider)
        $i += +3;
        $post_id = $i + 48;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 10,
                    "title" => "اسمنت حضرموت",
                    "title_en" => "Hadhramaut Cement",
                    "slug" => "",
                    "color" => "",
                    "content" => "ثقة بحجم الاسم",
                    "content_en" => "Trust as big as the name",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 10,
                    "title" => "قوة البناء",
                    "title_en" => "Construction strength",
                    "slug" => "",
                    "color" => "",
                    "content" => "أسسها صح",
                    "content_en" => "Establish it Right",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 10,
                    "title" => "فخر الصناعة",
                    "title_en" => "Pride of industry",
                    "slug" => "",
                    "color" => "",
                    "content" => "اختار صح",
                    "content_en" => "Choose correct",
                    "order" => 3,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );
        $i +=2;
        //      Certificate 56
        $post_id = $i + 49;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "نظام إدارة الطاقة ISO 50001:2018 SGS",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "نظام إدارة الجودة العالمي  ISO 9001:2015 SGS",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "نظام إدارة البيئة ISO 14001:2015",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "نظام إدارة الصحة والسلامة المهنية ISO 45001:2018",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "شهادة فحص حضرموت المقاوم SGS",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "شهادة فحص حضرموت الاخضر SGS",
                    "slug" => "",
                    "color" => "",
                    "content" => "",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );

        //      Hadrami 100%  starts from 64
        // $i = 9
        $post_id = $i + 55;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "بنك التضامن المكلا",
                    "slug" => "",
                    "color" => "",
                    "content" => "<p><b>الموقع : المكلا </b>&nbsp;</p>",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "سوق العسل القطن",
                    "slug" => "",
                    "color" => "",
                    "content" => "<p><b>الموقع : المكلا </b>&nbsp;</p>",
                    "order" => 2,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "مجمع الساحل التموينات النفطية",
                    "slug" => "",
                    "color" => "",
                    "content" => "<p><b>الموقع : بروم </b>&nbsp;</p>",
                    "order" => 3,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "مركز الصادرات السمكية",
                    "slug" => "",
                    "color" => "",
                    "content" => "<p><b>الموقع : المكلا </b>&nbsp;</p>",
                    "order" => 4,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "مشروع البييئة المصطفوية",
                    "slug" => "",
                    "color" => "",
                    "content" => "<p><b>الموقع : تريم </b>&nbsp;</p>",
                    "order" => 5,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "مشـــروع الطاقة الشمسية",
                    "slug" => "",
                    "color" => "",
                    "content" => "<p><b>الموقع : شبوة - عتق </b>&nbsp;</p>",
                    "order" => 6,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "مشروع سوق البصل  تريم",
                    "slug" => "",
                    "color" => "",
                    "content" => "<p><b>الموقع : تريم </b>&nbsp;</p>",
                    "order" => 7,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "مشروع مدرسة سمية",
                    "slug" => "",
                    "color" => "",
                    "content" => "<p><b>الموقع : المكلا </b>&nbsp;</p>",
                    "order" => 7,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );

        //      map and other systems css and ess
        // $i = 9
        $post_id =  74;
        PostDetail::insert(
            [
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "الخريطة",
                    "title_en" => "map",
                    "slug" => "",
                    "color" => "",
                    "content" => "https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d110080.8736144521!2d49.16288627403333!3d14.79688214490781!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3de893007d1d83f7%3A0xf42430a68aa3a92e!2z2KfZhNi02LHZg9ipINin2YTYudix2KjZitipINin2YTZitmF2YbZitipINmE2YTYp9iz2YXZhtiqINin2YTZhdit2K_ZiNiv2Kk!5e1!3m2!1sen!2sus!4v1761249135312!5m2!1sen!2sus",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "الخدمة الذاتية للموظفين (ESS)",
                    "title_en" => "Employee Self System (ESS)",
                    "slug" => "",
                    "color" => "",
                    "content" => "http://ixerpweb.ayccl.com:8189/ixias/F?P=IXESS",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "الخدمة الذاتية للعملاء (CSS)",
                    "title_en" => "Customer Self System (CSS)",
                    "slug" => "",
                    "color" => "",
                    "content" => "http://ixerpweb.ayccl.com:8189/ixias/F?P=IXCSS",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "رقم الاتصال المباشر",
                    "title_en" => "Direct Call Number",
                    "slug" => "",
                    "color" => "",
                    "content" => "+967711003019",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "رقم الواتساب",
                    "title_en" => "Whatsapp Number",
                    "slug" => "",
                    "color" => "",
                    "content" => "967711003019",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
                [
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "صفحة الفيسبوك",
                    "title_en" => "FaceBook Page",
                    "slug" => "",
                    "color" => "",
                    "content" => "https://www.facebook.com/plugins/page.php?href=https%3A%2F%2Fwww.facebook.com%2FAYCCLYemen%2F&tabs=timeline&width=300&height=475&small_header=true&adapt_container_width=false&hide_cover=true&show_facepile=false&appId",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],[
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "صفحة اليوتيوب",
                    "title_en" => "YouTube Page",
                    "slug" => "",
                    "color" => "",
                    "content" => "UIR8pAQBIdH-wS0Z06UPpQA",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],[
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "صفحة الانستجرام",
                    "title_en" => "Instagram Page",
                    "slug" => "",
                    "color" => "",
                    "content" => "https://www.instagram.com/p/DN3YAZS2hr2/?utm_source=ig_embed&amp;utm_campaign=loading",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],[
                    "post_id" => $post_id++,
                    "category_id" => 1,
                    "title" => "صفحة إكس (تويتر)",
                    "title_en" => "X (Twitter) Page",
                    "slug" => "",
                    "color" => "",
                    "content" => "https://twitter.com/AYCCLYemen/status/1605245208555315201?ref_src=twsrc%5Etfw",
                    "order" => 1,
                    'created_at' => Carbon::now(),
                    'updated_at' => Carbon::now(),
                ],
            ]
        );
    }
}
